modules/multiDimAMR/tutorials/capillaryRiseAxi/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 2;
        cAlpha          1;

        // MULESCorr       yes;
        // nLimiterIter    3;

        // solver          PBiCG;
        // preconditioner  DILU;
        // smoother        symGaussSeidel;
        // tolerance       1e-14;
        // relTol          0;

        // //-- interfaceCompression experimental stuff
        // solveExpl       OPT_EXPL_SOLVE;
        // comprNonCoupledBounds OPT_COMPRESS_NON_COUPLED_BOUNDS; 
        // compressInterface OPT_COMPRESS_INTERFACE;         //Option only with solvExpl no;
        
        // minIsoComprVel 0; // 0.0
        // isIsoUf        0; // 1
        // //--
    }



    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-07;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    UFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nCorrectors     4;
    nNonOrthogonalCorrectors      1;
    nAlphaCorr      1;
    nAlphaSubCycles 2;
    cAlpha          1;
}



// *************************************************************************//
