modules/multiDimAMR/tutorials/capillaryRiseAxi/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue p_rgh 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        //box (0 0 0) (1 273.4375e-6 1);
	box (0 0 -1) (1 0.00375 1);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

);


// ************************************************************************* //
